charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
/* -------------------------------------------------------------------------- */
/* Host mode: the inspector                                                    */
/* -------------------------------------------------------------------------- */

static void client_event_cb(const usb_host_client_event_msg_t *msg, void *arg)
{
    /* Runs inside usb_host_client_handle_events(), in the client task. Only
     * take note here; the opening is done by the task loop, as the IDF
     * example does. */
    if (msg->event == USB_HOST_CLIENT_EVENT_NEW_DEV) {
        if (s_pending_new_n < AOS_USB_MAX_DEV) {
            s_pending_new[s_pending_new_n++] = msg->new_dev.address;
        }
    } else if (msg->event == USB_HOST_CLIENT_EVENT_DEV_GONE) {
        if (s_pending_gone_n < AOS_USB_MAX_DEV) {
            s_pending_gone[s_pending_gone_n++] = msg->dev_gone.dev_hdl;
        }
    }
}

static void inspect(uint8_t addr)
{
    usb_device_handle_t hdl;
    esp_err_t e = usb_host_device_open(s_client, addr, &hdl);
    if (e != ESP_OK) {
        ESP_LOGW(TAG, "open device %d: %s", addr, esp_err_to_name(e));
        return;
    }
    usb_device_info_t info;
    const usb_device_desc_t *dd;
    const usb_config_desc_t *cd;
    if (usb_host_device_info(hdl, &info) != ESP_OK ||
        usb_host_get_device_descriptor(hdl, &dd) != ESP_OK ||
        usb_host_get_active_config_descriptor(hdl, &cd) != ESP_OK) {
        ESP_LOGW(TAG, "device %d: could not read its descriptors", addr);
        usb_host_device_close(s_client, hdl);
        return;
    }

    /* To the log, in full, with IDF's printers. */
    ESP_LOGI(TAG, "new device at address %d, %s speed", addr,
             (const char *[]) { "low", "full", "high" }[info.speed]);
    usb_print_device_descriptor(dd);
    usb_print_config_descriptor(cd, NULL);
    if (info.str_desc_manufacturer) usb_print_string_descriptor(info.str_desc_manufacturer);
    if (info.str_desc_product)      usb_print_string_descriptor(info.str_desc_product);
    if (info.str_desc_serial_num)   usb_print_string_descriptor(info.str_desc_serial_num);

    /* And to the table, for /api/usb. */
    xSemaphoreTake(s_lock, portMAX_DELAY);
    aos_usb_dev_t *d = NULL;
    for (int i = 0; i < AOS_USB_MAX_DEV; i++) {
        if (!s_devs[i].used) { d = &s_devs[i]; break; }
    }
    if (d) {
        memset(d, 0, sizeof(*d));
        d->used = true;
        d->hdl = hdl;
        d->addr = addr;
        d->speed = info.speed;
        d->vid = dd->idVendor;
        d->pid = dd->idProduct;
        d->dev_class = dd->bDeviceClass;
        d->dev_subclass = dd->bDeviceSubClass;
        d->dev_protocol = dd->bDeviceProtocol;
        for (int i = 0; i < cd->bNumInterfaces && d->n_itf < AOS_USB_MAX_ITF; i++) {
            int off = 0;
            const usb_intf_desc_t *itf = usb_parse_interface_descriptor(cd, i, 0, &off);
            if (!itf) {
                continue;
            }
            d->itf_class[d->n_itf] = itf->bInterfaceClass;
            d->itf_subclass[d->n_itf] = itf->bInterfaceSubClass;
            d->itf_protocol[d->n_itf] = itf->bInterfaceProtocol;
            d->n_itf++;
        }
        str_copy(d->manufacturer, sizeof(d->manufacturer), info.str_desc_manufacturer);
        str_copy(d->product, sizeof(d->product), info.str_desc_product);
        str_copy(d->serial, sizeof(d->serial), info.str_desc_serial_num);
        s_seen++;
        ESP_LOGI(TAG, "device %d: %04x:%04x \"%s\" \"%s\", %d interface(s), first class %s",
                 addr, d->vid, d->pid, d->manufacturer, d->product, d->n_itf,
                 d->n_itf ? class_name(d->itf_class[0]) : "-");
    } else {
        ESP_LOGW(TAG, "device %d: the table is full, closing it", addr);
        usb_host_device_close(s_client, hdl);
    }
    xSemaphoreGive(s_lock);
}

static void drop_gone(usb_device_handle_t hdl)
{
    /* The handle stays valid until it is closed; closing it is what lets the
     * library free the device. */
    xSemaphoreTake(s_lock, portMAX_DELAY);
    for (int i = 0; i < AOS_USB_MAX_DEV; i++) {
        if (s_devs[i].used && s_devs[i].hdl == hdl) {
            ESP_LOGI(TAG, "device %d gone", s_devs[i].addr);
            usb_host_device_close(s_client, hdl);
            s_devs[i].used = false;
        }
    }
    xSemaphoreGive(s_lock);
}

static void close_all(void)
{
    xSemaphoreTake(s_lock, portMAX_DELAY);
    for (int i = 0; i < AOS_USB_MAX_DEV; i++) {
        if (s_devs[i].used) {
            usb_host_device_close(s_client, s_devs[i].hdl);
            s_devs[i].used = false;
        }
    }
    xSemaphoreGive(s_lock);
}

/* ---- H1: the pendrive ---------------------------------------------------- */

static void msc_event_cb(const msc_host_event_t *ev, void *arg)
{
    if (ev->event == MSC_DEVICE_CONNECTED) {
        s_msc_pending_addr = ev->device.address;
    } else if (ev->event == MSC_DEVICE_DISCONNECTED) {
        s_msc_pending_gone = true;
    }
}

static void msc_unmount(void)
{
    if (s_msc_vfs) {
        msc_host_vfs_unregister(s_msc_vfs);
        s_msc_vfs = NULL;
    }
    if (s_msc_dev) {
        msc_host_uninstall_device(s_msc_dev);
        s_msc_dev = NULL;
    }
    if (s_msc_mounted) {
        ESP_LOGI(TAG, "pendrive unmounted from " AOS_USB_MSC_ROOT);
    }
    s_msc_mounted = false;
}

static void msc_mount(uint8_t addr)
{
    if (s_msc_dev) {
        ESP_LOGW(TAG, "a second MSC device (address %d): one at a time, ignored", addr);
        return;
    }
    esp_err_t e = msc_host_install_device(addr, &s_msc_dev);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "msc_host_install_device: %s", esp_err_to_name(e));
        s_msc_dev = NULL;
        return;
    }
    msc_host_device_info_t info;
    if (msc_host_get_device_info(s_msc_dev, &info) == ESP_OK) {
        s_msc_sectors = info.sector_count;
        s_msc_sector_size = info.sector_size;
        ESP_LOGI(TAG, "pendrive: %lu sectors of %lu B = %lu MB",
                 (unsigned long)info.sector_count, (unsigned long)info.sector_size,
                 (unsigned long)((uint64_t)info.sector_count * info.sector_size >> 20));
    }
    const esp_vfs_fat_mount_config_t cfg = {
        .format_if_mount_failed = false,
        .max_files = 4,
        .allocation_unit_size = 16 * 1024,
    };
    e = msc_host_vfs_register(s_msc_dev, AOS_USB_MSC_ROOT, &cfg, &s_msc_vfs);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "msc_host_vfs_register: %s (not FAT?)", esp_err_to_name(e));
        s_msc_vfs = NULL;
        msc_host_uninstall_device(s_msc_dev);
        s_msc_dev = NULL;
        return;
    }
    s_msc_mounted = true;
    uint64_t total = 0, free_b = 0;
    esp_vfs_fat_info(AOS_USB_MSC_ROOT, &total, &free_b);
    ESP_LOGI(TAG, "pendrive mounted at " AOS_USB_MSC_ROOT ": %llu MB, %llu MB free",
             (unsigned long long)(total >> 20), (unsigned long long)(free_b >> 20));
}

