charliejgallo/ESP32S3_AmoledOS/components/aos_usb/aos_usb.c
    bool ok = true;
    if (mode != AOS_USB_CONSOLE) {
        if (s_pm_lock) esp_pm_lock_acquire(s_pm_lock);
        ok = (mode == AOS_USB_DEVICE) ? device_start()
           : (mode == AOS_USB_DISK)   ? disk_start()
           :                            host_start();
        if (ok) {
            s_mode = mode;
        } else {
            phy_back_to_console();
            if (s_pm_lock) esp_pm_lock_release(s_pm_lock);
        }
        mem_line(ok ? aos_usb_mode_name(mode) : "mode failed, console");
    }
    ESP_LOGI(TAG, "usb: %s", aos_usb_mode_name(s_mode));
    STEP(40);
    xSemaphoreGive(s_lock);
    return ok;
}

/* -------------------------------------------------------------------------- */
/* /api/usb                                                                    */
/* -------------------------------------------------------------------------- */

int aos_usb_status_json(char *out, size_t len)
{
    ensure_init();
    int n = snprintf(out, len, "{\"mode\":\"%s\",\"console_on_cdc\":%s,\"card_away\":%s,\"boot_step\":%lu,\"seen\":%d,\"devices\":[",
                     aos_usb_mode_name(s_mode), s_console_on_cdc ? "true" : "false",
                     s_card_away ? "true" : "false", (unsigned long)s_boot_step, s_seen);
    if (s_lock) xSemaphoreTake(s_lock, portMAX_DELAY);
    bool first = true;
    for (int i = 0; i < AOS_USB_MAX_DEV && n < (int)len; i++) {
        const aos_usb_dev_t *d = &s_devs[i];
        if (!d->used) {
            continue;
        }
        n += snprintf(out + n, len - n, "%s{\"addr\":%d,\"speed\":\"%s\",\"vid\":\"%04x\",\"pid\":\"%04x\","
                      "\"class\":%d,\"manufacturer\":\"%s\",\"product\":\"%s\",\"serial\":\"%s\",\"itf\":[",
                      first ? "" : ",", d->addr,
                      (const char *[]) { "low", "full", "high" }[d->speed < 3 ? d->speed : 1],
                      d->vid, d->pid, d->dev_class, d->manufacturer, d->product, d->serial);
        for (int j = 0; j < d->n_itf && n < (int)len; j++) {
            n += snprintf(out + n, len - n, "%s{\"class\":%d,\"name\":\"%s\",\"sub\":%d,\"proto\":%d}",
                          j ? "," : "", d->itf_class[j], class_name(d->itf_class[j]),
                          d->itf_subclass[j], d->itf_protocol[j]);
        }
        if (n < (int)len) n += snprintf(out + n, len - n, "]}");
        first = false;
    }
    if (s_lock) xSemaphoreGive(s_lock);
    if (n < (int)len) {
        /* Raw registers, for the days a device is plugged and nothing
         * happens: HPRT bit 0 = connected, 1 = connect detected, 2 = port
         * enabled, 12 = port powered, 17-18 = speed; GOTGCTL bit 16 = ID
         * (0 host), 18/19 = A/B session valid; RTC usb_conf bit 19 =
         * sw_usb_phy_sel (1 = the PHY is on the OTG), 20 = sw override on.
         *
         * ONLY while an OTG mode is on. Leaving a mode gates the OTG
         * peripheral's clock, and on the S3 a read of a clock-gated
         * peripheral hangs the bus: the CPU stalls with interrupts dead and
         * the interrupt watchdog resets the chip, with no panic and no core
         * dump. Every "crash on leaving a mode" of 2026-09-12 was this read,
         * one HTTP response after the switch had already finished. */
        usb_host_lib_info_t li = { 0 };
        if (s_mode == AOS_USB_HOST) usb_host_lib_info(&li);
        uint64_t total = 0, free_b = 0;
        if (s_msc_mounted) esp_vfs_fat_info(AOS_USB_MSC_ROOT, &total, &free_b);
        n += snprintf(out + n, len - n, "],\"msc\":{\"mounted\":%s,\"root\":\"%s\",\"sectors\":%lu,"
                      "\"sector_size\":%lu,\"kb_total\":%llu,\"kb_free\":%llu},",
                      s_msc_mounted ? "true" : "false", s_msc_mounted ? AOS_USB_MSC_ROOT : "",
                      (unsigned long)s_msc_sectors, (unsigned long)s_msc_sector_size,
                      (unsigned long long)(total >> 10), (unsigned long long)(free_b >> 10));
        bool otg = s_mode != AOS_USB_CONSOLE;
        n += snprintf(out + n, len - n, "\"regs\":{\"hprt\":\"0x%08x\",\"gotgctl\":\"0x%08x\","
                      "\"gusbcfg\":\"0x%08x\",\"gintsts\":\"0x%08x\",\"wrap_otg_conf\":\"0x%08x\","
                      "\"rtc_usb_conf\":\"0x%08x\",\"lib_devices\":%d,\"lib_clients\":%d},",
                      otg ? (unsigned)USB_DWC.hprt_reg.val : 0, otg ? (unsigned)USB_DWC.gotgctl_reg.val : 0,
                      otg ? (unsigned)USB_DWC.gusbcfg_reg.val : 0, otg ? (unsigned)USB_DWC.gintsts_reg.val : 0,
                      otg ? (unsigned)USB_WRAP.otg_conf.val : 0, (unsigned)RTCCNTL.usb_conf.val,
                      li.num_devices, li.num_clients);
    }
    if (n < (int)len) {
        n += snprintf(out + n, len - n, "\"mem\":{\"internal\":%u,\"exec\":%u,\"exec_block\":%u}}",
                      (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
                      (unsigned)heap_caps_get_free_size(MALLOC_CAP_EXEC),
                      (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_EXEC));
    }
    return n;
}
